Revit 2027 API
PipingSystemType.ValidateRiseDropSymbolType Method
 Confirms if the parameter is a valid piping rise/drop symbol type.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ValidateRiseDropSymbolType(
	RiseDropSymbol risedropType
)
Public Function ValidateRiseDropSymbolType (
	risedropType As RiseDropSymbol
) As Boolean
public:
bool ValidateRiseDropSymbolType(
	RiseDropSymbol risedropType
)
member ValidateRiseDropSymbolType :
        risedropType : RiseDropSymbol -> bool
Parameters
risedropType RiseDropSymbol
 The type.
Return Value
Boolean
 True if the input is a valid piping rise/drop symbol type, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace